In [1]:
import numpy as np
import pandas as pd

In [2]:
#create dataframe from dict of series for summer olympics: 1996 to 2012
olympic_series_participation = pd.Series([205, 204, 201, 200, 197], index=[2012, 2008, 2004, 2000, 1996])
olympic_series_country = pd.Series(['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'], index=[2012, 2008, 2004, 2000, 1996])
df_olympic_series = pd.DataFrame({'No. of participating countries': olympic_series_participation, 'Host': olympic_series_country})

In [3]:
df_olympic_series

         Host  No. of participating countries
2012   London                             205
2008  Beijing                             204
2004   Athens                             201
2000   Sydney                             200
1996  Atlanta                             197

In [4]:
#view dataframe describe
df_olympic_series.describe

<bound method DataFrame.describe of          Host  No. of participating countries
2012   London                             205
2008  Beijing                             204
2004   Athens                             201
2000   Sydney                             200
1996  Atlanta                             197>

In [12]:
#view top 2 records
df_olympic_series.head(2)

         Host  No. of participating countries
2012   London                             205
2008  Beijing                             204

In [13]:
#view the last 3 records
df_olympic_series.tail(3)

         Host  No. of participating countries
2004   Athens                             201
2000   Sydney                             200
1996  Atlanta                             197

In [14]:
#view indexes of dataset
df_olympic_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [15]:
#view columns of the dataset
df_olympic_series.columns

Index([u'Host', u'No. of participating countries'], dtype='object')

In [16]:
#select data for Host Cities
df_olympic_series['Host']

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host, dtype: object

In [17]:
#another data selection No. of participating countries 
df_olympic_series['No. of participating countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: No. of participating countries, dtype: int64

In [18]:
#select lable-location based access by Label
df_olympic_series.loc[2012]

Host                              London
No. of participating countries       205
Name: 2012, dtype: object

In [19]:
#Integer-Location based indexing by position
df_olympic_series.iloc[0:2]

         Host  No. of participating countries
2012   London                             205
2008  Beijing                             204

In [20]:
#Integer-Location based data selection by index value
df_olympic_series.iat[3,1]

200

In [22]:
#select data element by condition where number of participated countries are more than 200
#hint - use boolean expression
df_olympic_series[df_olympic_series['No. of participating countries']>200]

         Host  No. of participating countries
2012   London                             205
2008  Beijing                             204
2004   Athens                             201